notes/linux/wildcards.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-25 Sat 22:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wildcards</title>
<meta name="author" content="Daniel Min" />
<meta name="description" content="Linux globbing and wildcards" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wildcards</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge3d8dad">Wildcards (Globbing)</a>
<ul>
<li><a href="#org0d99312">Examples</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge3d8dad" class="outline-2">
<h2 id="orge3d8dad">Wildcards (Globbing)</h2>
<div class="outline-text-2" id="text-orge3d8dad">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Wildcard</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">Match any character</td>
</tr>

<tr>
<td class="org-left"><code>?</code></td>
<td class="org-left">Match a single character</td>
</tr>

<tr>
<td class="org-left"><code>[characters]</code></td>
<td class="org-left">Matches any specified characters</td>
</tr>

<tr>
<td class="org-left"><code>[!character]</code></td>
<td class="org-left">Matches any character that <b>DOESN&rsquo;T</b> match the specified characters</td>
</tr>

<tr>
<td class="org-left"><code>[[:alnum:]]</code></td>
<td class="org-left">Matches any alphanumeric character</td>
</tr>

<tr>
<td class="org-left"><code>[[:alpha:]]</code></td>
<td class="org-left">Matches any alphabetic character</td>
</tr>

<tr>
<td class="org-left"><code>[[:digit:]]</code></td>
<td class="org-left">Matches any digit</td>
</tr>

<tr>
<td class="org-left"><code>[[:lower:]]</code></td>
<td class="org-left">Matches any lowercase letter</td>
</tr>

<tr>
<td class="org-left"><code>[[:upper:]]</code></td>
<td class="org-left">Matches any uppercase letter</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org0d99312" class="outline-3">
<h3 id="org0d99312">Examples</h3>
<div class="outline-text-3" id="text-org0d99312">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Pattern</th>
<th scope="col" class="org-left">Matches</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>*</code></td>
<td class="org-left">Matches any file</td>
</tr>

<tr>
<td class="org-left"><code>g*</code></td>
<td class="org-left">Begins with <code>g</code></td>
</tr>

<tr>
<td class="org-left"><code>b*.txt</code></td>
<td class="org-left">Begins with <code>b</code> and ends with <code>.txt</code></td>
</tr>

<tr>
<td class="org-left"><code>Data???</code></td>
<td class="org-left">Begins with <code>Data</code> and ends with <span class="underline">3 characters</span></td>
</tr>

<tr>
<td class="org-left"><code>[abc]*</code></td>
<td class="org-left">Begins with <code>a, b,</code> or <code>c</code></td>
</tr>

<tr>
<td class="org-left"><code>BACKUP.[0-9][0-9][0-9]</code></td>
<td class="org-left">Begins with <code>BACKUP.</code> and ends with <span class="underline">3 digits</span></td>
</tr>

<tr>
<td class="org-left"><code>[[:upper:]]*</code></td>
<td class="org-left">Begins with an <span class="underline">uppercase letter</span></td>
</tr>

<tr>
<td class="org-left"><code>[![:digit:]]*</code></td>
<td class="org-left"><b>DOESN&rsquo;T</b> begin with a digit</td>
</tr>

<tr>
<td class="org-left"><code>*[[:lower:]123]</code></td>
<td class="org-left">Ends with <code>1, 2, 3</code> or <span class="underline">lowercase letter</span></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Min</p>
<p class="date">Created: 2024-05-25 Sat 22:16</p>
</div>
</body>
</html>
